---
title: HVACLoadSpaceType
classe: Autodesk.Revit.DB.Analysis.HVACLoadSpaceType
namespace: Autodesk.Revit.DB.Analysis
eredita: Autodesk.Revit.DB.Analysis.HVACLoadType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# HVACLoadSpaceType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsPlenum { get; }` | `hVACLoadSpaceType.IsPlenum` | Boolean |
| `String SpaceTypeName { get; set; }` | `hVACLoadSpaceType.SpaceTypeName` | String |
| `HVACLoadSpaceType Create(Document, String)` | `HVACLoadSpaceType.Create(document, name)` | HVACLoadSpaceType |
| `Boolean IsNameUnique(String)` | `hVACLoadSpaceType.IsNameUnique(name)` | Boolean |
| `Boolean IsNameUnique(Document, String)` | `HVACLoadSpaceType.IsNameUnique(document, name)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```